04_Simulation/pehill/case_1p2/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            (sampling);

interpolationScheme cellPoint;

setFormat       csv;

sets
(
    line1
    {
        type    uniform;
        axis    xyz;
        start   (1.08573 0.522747 0.05);
        end     (1.08573 3.036 0.05);
        nPoints 1000;
    }
    line2
    {
        type    uniform;
        axis    xyz;
        start   (1.48055 .27039 0.05);
        end     (1.48055 3.036 0.05);
        nPoints 1000;
    }
    line3
    {
        type    uniform;
        axis    xyz;
        start   (1.87536 .0768397 0.05);
        end     (1.87536 3.036 0.05);
        nPoints 1000;
    }
    line4
    {
        type    uniform;
        axis    xyz;
        start   (2.36887 0 0.05);
        end     (2.36887 3.036 0.05);
        nPoints 1000;
    }
    line5
    {
        type    uniform;
        axis    xyz;
        start   (3.1585 0 0.05);
        end     (3.1585 3.036 0.05);
        nPoints 1000;
    }
    line6
    {
        type    uniform;
        axis    xyz;
        start   (6.2189 0 0.05);
        end     (6.2189 3.036 0.05);
        nPoints 1000;
    }
    line7
    {
        type    uniform;
        axis    xyz;
        start   (8.6857 0.530512 0.05);
        end     (8.6857 3.036 0.05);
        nPoints 1000;
    }
);

fields          (UDNS);

// ************************************************************************* //
